app/controllers/api/products_controller.rb

    def index
      categories = Category.with_attached_image
                           .with_attached_imageorange
                           .select(:id, :name)
                           .map do |c|
        {
          id: c.id,
          name: c.name,
          image: optimized_image_url(c.image, resize_to_limit: [320, 320]),
          imageorange: optimized_image_url(c.imageorange, resize_to_limit: [320, 320])
        }
      end

      products = Product.with_attached_image
                        .select(:id, :name, :reference, :description, :colors, :matiere, :grammage, :quality, :sizes_available, :subname, :category_id)
                        .map do |p|
---
SELECT "categories"."id", "categories"."name" FROM "categories"
SELECT "products"."id", "products"."name", "products"."reference", "products"."description", "products"."colors", "products"."matiere", "products"."grammage", "products"."quality", "products"."sizes_available", "products"."subname", "products"."category_id" FROM "products"